// Задача №1. Найти квадрат числа

Console.WriteLine("Введите целое число:  ");
int number = Convert.ToInt32 (Console.ReadLine());
int square = number*number;
Console.WriteLine ($"Квадрат числа {number} = {square}");
